app/controllers/application_controller.rb

SELECT  "hosts".* FROM "hosts" WHERE "hosts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def current_user
    @current_user ||= Host.find_by_id(session[:host_id])