app/controllers/hosts_controller.rb

INSERT INTO "hosts" ("name", "email", "password_digest") VALUES (?, ?, ?)  [["name", "Jerry Garcia"], ["email", "jerry@darkstar.com"], ["password_digest", "$2a$12$Pcy6C4xUZFWc9JTqMuGjnOQ/d1/nSpmgqoSoRDvSXm41glLRn7ty6"]]
---
  def create
    @host = Host.new(host_params)
    if @host.save

DELETE FROM "hosts" WHERE "hosts"."id" = ?  [["id", 3]]
---
  def destroy
    grab_host
    @host.destroy

SELECT  "hosts".* FROM "hosts" WHERE "hosts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def grab_host
    @host = Host.find(session[:host_id])