app/controllers/interviews_controller.rb

INSERT INTO "guests" ("name", "email", "expertise", "interview_id") VALUES (?, ?, ?, ?)  [["name", "Thor"], ["email", "thor@avengers.com"], ["expertise", "Smashing Stuff"], ["interview_id", 1]]
INSERT INTO "interviews" ("date", "show_id", "start_time", "end_time") VALUES (?, ?, ?, ?)  [["date", "2020-02-23 00:00:00 UTC"], ["show_id", 1], ["start_time", "4:00 pm"], ["end_time", "5:00 pm"]]
UPDATE "interviews" SET "recorded" = ? WHERE "interviews"."id" = ?  [["recorded", 1], ["id", 3]]
INSERT INTO "guests" ("name", "email", "expertise", "interview_id") VALUES (?, ?, ?, ?)  [["name", "John Doe"], ["email", "j.doe@example.com"], ["expertise", "nothing"], ["interview_id", 10]]
INSERT INTO "interviews" ("date", "show_id", "start_time", "end_time") VALUES (?, ?, ?, ?)  [["date", "2019-10-02 00:00:00 UTC"], ["show_id", 2], ["start_time", "2:00 pm"], ["end_time", "3:00 pm"]]
---
  def create
    if logged_in?
      grab_host_show
      @interview = @show.interviews.new(interview_params)
      @guest = @interview.build_guest(interview_params[:guest_attributes])
      if @guest.save
        @interview.guest = @guest
        if @interview.save

UPDATE "interviews" SET "published" = ? WHERE "interviews"."id" = ?  [["published", 1], ["id", 1]]
---
  def update
    grab_host_show_int
    @interview.update_attributes(interview_params)

DELETE FROM "interviews" WHERE "interviews"."id" = ?  [["id", 11]]
---
  def destroy
    if logged_in?
      grab_host_show_int
      @interview.destroy

SELECT  "hosts".* FROM "hosts" WHERE "hosts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "shows".* FROM "shows" WHERE "shows"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def grab_host_show
    @host = Host.find(session[:host_id])
    @show = Show.find(params[:show_id])

SELECT  "hosts".* FROM "hosts" WHERE "hosts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "shows".* FROM "shows" WHERE "shows"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "interviews".* FROM "interviews" WHERE "interviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def grab_host_show_int
    @host = Host.find(session[:host_id])
    @show = Show.find(params[:show_id])
    @interview = Interview.find(params[:id])