app/controllers/sessions_controller.rb

  def oauth_process
    oauth_email = request.env['omniauth.auth']['info']['email']
    oauth_name = request.env['omniauth.auth']['info']['name']
    oauth_pw = SecureRandom.hex
    if @host = Host.find_by(email: oauth_email)
---
SELECT  "hosts".* FROM "hosts" WHERE "hosts"."email" = ? LIMIT ?  [["email", "kerneltux0@gmail.com"], ["LIMIT", 1]]

  def email_pw_process
    @host = Host.find_by(email: params[:host][:email])
---
SELECT  "hosts".* FROM "hosts" WHERE "hosts"."email" = ? LIMIT ?  [["email", "jerry@darkstar.com"], ["LIMIT", 1]]