app/controllers/shows_controller.rb

SELECT  "hosts".* FROM "hosts" WHERE "hosts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def new
    if logged_in?
      @host = Host.find(session[:host_id])

SELECT  "hosts".* FROM "hosts" WHERE "hosts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "shows" ("title", "description", "category", "url", "duration") VALUES (?, ?, ?, ?, ?)  [["title", "Brokedown Palace"], ["description", "Conversational & off-the-cuff about the human condition"], ["category", "Misc"], ["url", "brokedown-pod.com"], ["duration", "fluid"]]
UPDATE "shows" SET "host_id" = ? WHERE "shows"."id" = ?  [["host_id", 3], ["id", 2]]
---
  def create
    if logged_in?
      @host = Host.find(session[:host_id])
      @show = Show.new(show_params)
      if @show.save
        @host.shows << @show
        @host.save

SELECT  "hosts".* FROM "hosts" WHERE "hosts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "shows".* FROM "shows" WHERE "shows"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    if logged_in?
      @host = Host.find(session[:host_id])
      @show = Show.find(params[:id])

SELECT  "hosts".* FROM "hosts" WHERE "hosts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "shows".* FROM "shows" WHERE "shows"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    if logged_in?
      @host = Host.find(session[:host_id])
      @show = Show.find(params[:id])

SELECT  "hosts".* FROM "hosts" WHERE "hosts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "shows".* FROM "shows" WHERE "shows"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "shows" SET "description" = ? WHERE "shows"."id" = ?  [["description", "something something"], ["id", 1]]
---
  def update
    if logged_in?
      @host = Host.find(session[:host_id])
      @show = Show.find(params[:id])
      @show.update_attributes(show_params)

SELECT  "hosts".* FROM "hosts" WHERE "hosts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "shows".* FROM "shows" WHERE "shows"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "shows" WHERE "shows"."id" = ?  [["id", 2]]
---
  def destroy
    if logged_in?
      @host = Host.find(session[:host_id])
      @show = Show.find(params[:id])
      @show.destroy