app/controllers/shows_controller.rb

  def create
    if logged_in?
      grab_host_show
      if @show.save
---
UPDATE "shows" SET "host_id" = ? WHERE "shows"."id" = ?  [["host_id", 3], ["id", 3]]

  def destroy
    if logged_in?
      grab_host_show
      @show.destroy
---
DELETE FROM "shows" WHERE "shows"."id" = ?  [["id", 3]]